{
    "destination": "Cebu",
    "weather": "26.68°C, light rain\n26.58°C, overcast clouds\n26.37°C, broken clouds",
    "hotels": "Top Hotels & Attractions in Cebu:\n- [TripAdvisor Hotels](https://www.tripadvisor.com/Search?q=Cebu+hotels)\n- [Travel Guides](https://www.hotels.com/go/Cebu)\n",
    "itinerary": "Based on the weather forecast, here's a 3-day itinerary for Cebu:\n\n**Day 1: June 16th (26.68°C, light rain)**\n\n* Morning: Start the day with a hearty breakfast at Café Marco, a local favorite located in the heart of Cebu City. Try their signature dishes, such as the Cebu-style breakfast or the Cebu lechon kawali (crispy fried pork belly). (PHP 500 - PHP 1,000 per person)\n* Afternoon: Visit the Basilica del Santo Niño, a historic church that dates back to the 16th century. Take a moment to admire the stunning architecture and explore the surrounding area. (Free admission)\n* Evening: Head to the SM Seaside City Cebu mall and enjoy the scenic views of the Cebu Strait. You can also dine at one of the many restaurants or cafes in the area. (PHP 500 - PHP 1,000 per person)\n\n**Day 2: June 17th (26.58°C, overcast clouds)**\n\n* Morning: Take a day trip to the nearby islands of Mactan. Visit the Mactan Shrine, a historic landmark that commemorates the Battle of Mactan between Lapu-Lapu and Ferdinand Magellan. (PHP 20 - PHP 50 per person)\n* Afternoon: Explore the beautiful beaches of Mactan, such as the Punta Engaño Beach or the Marimegmeg Beach. You can also try snorkeling or paddleboarding to get a closer look at the marine life. (PHP 500 - PHP 1,000 per person)\n* Evening: Enjoy a sunset dinner cruise around the Cebu Strait. You can choose from a variety of cruise operators that offer seafood buffets and live music. (PHP 1,500 - PHP 3,000 per person)\n\n**Day 3: June 18th (26.37°C, broken clouds)**\n\n* Morning: Visit the Cebu Taoist Temple, a stunning temple that offers breathtaking views of the city. Take a moment to explore the peaceful surroundings and contemplate the beauty of nature. (Free admission)\n* Afternoon: Explore the vibrant streets of Cebu's famous Mango Avenue, known for its trendy restaurants, bars, and boutiques. You can grab lunch at one of the many eateries or cafes in the area. (PHP 500 - PHP 1,000 per person)\n* Evening: End your trip with a visit to the famous Magellan's Cross, a historic landmark that commemorates the arrival of Spanish conquistador Ferdinand Magellan in Cebu. (Free admission)\n\n**Budget Breakdown:**\n\n* Accommodation: PHP 2,000 - PHP 4,000 per night (average)\n* Food: PHP 500 - PHP 1,000 per day (average)\n* Transportation: PHP 100 - PHP 200 per day (average)\n* Activities: PHP 500 - PHP 1,500 per day (average)\n* Total: PHP 6,100 - PHP 10,700 for 3 days\n\n**Packing List:**\n\n* Lightweight rain jacket or poncho\n* Comfortable walking shoes or sandals\n* Swimwear\n* Sunscreen and sun hat\n* Power adapter and charger for electronic devices\n* Camera and charger for capturing memories\n* Water bottle and refillable container for snacks\n* Light jacket or sweater for cooler evenings\n* Insect repellent and anti-mosquito spray\n* Travel documents and insurance papers\n* Portable charger for emergency situations\n\n**Hotel Recommendations:**\n\n* Citadines Cebu City (PHP 2,500 - PHP 4,500 per night)\n* Cebu Parklane International Hotel (PHP 2,500 - PHP 4,500 per night)\n* Waterfront Cebu City Hotel & Casino (PHP 3,000 - PHP 6,000 per night)\n\n**Attraction Recommendations:**\n\n* Mactan Shrine (PHP 20 - PHP 50 per person)\n* Cebu Taoist Temple (Free admission)\n* Magellan's Cross (Free admission)\n* Basilica del Santo Niño (Free admission)\n* SM Seaside City Cebu mall (Free admission)\n\nNote: Prices are estimates and may vary depending on the season and availability.",
    "budget": 570,
    "packing_list": [
        "Essentials: passport, tickets, wallet",
        "Electronics: phone, charger, power bank",
        "Rain gear: umbrella, waterproof shoes"
    ]
}