{
    "destination": "Chennai",
    "weather": "31.21°C, broken clouds\n30.87°C, broken clouds\n30.95°C, broken clouds",
    "hotels": "Top Hotels & Attractions in Chennai:\n- [TripAdvisor Hotels](https://www.tripadvisor.com/Search?q=Chennai+hotels)\n- [Travel Guides](https://www.hotels.com/go/Chennai)\n",
    "itinerary": "Chennai, the capital city of Tamil Nadu, India! With its rich history, cultural heritage, and vibrant city life, Chennai is a must-visit destination. Given the weather forecast, I've planned a 4-day itinerary for you to make the most of your trip. Here's your detailed itinerary:\n\n**Day 1: Historical Chennai**\n\n* Morning: Start your day with a sumptuous South Indian breakfast at a local eatery like Saravana Bhavan or Murugan Idli Shop. Try their signature dishes like idli, dosa, or vada.\n* Afternoon: Visit the Kapaleeswarar Temple (11:00 AM - 12:30 PM), a 7th-century Shiva temple famous for its stunning architecture and intricate carvings.\n* Evening: Head to the Fort St. George (4:00 PM - 6:00 PM), a 17th-century British fort that now serves as a museum. Explore the fort's history, architecture, and art exhibitions.\n\n**Day 2: Beachside Delight**\n\n* Morning: Begin the day with a visit to the Marina Beach (9:00 AM - 10:30 AM), one of the longest urban beaches in the world. You can take a leisurely walk, enjoy the sunrise, or try your hand at water sports like surfing or paddle-boarding.\n* Afternoon: Take a short drive to the Elliot's Beach (1:00 PM - 3:00 PM), a quieter beach with a more relaxed atmosphere. Enjoy a beachside lunch at one of the many restaurants or food stalls.\n* Evening: End the day with a sunset view at the Besant Nagar Beach (5:00 PM - 7:00 PM), known for its picturesque views and lively atmosphere.\n\n**Day 3: Cultural Chennai**\n\n* Morning: Visit the National Art Gallery (10:00 AM - 12:30 PM), which features an impressive collection of Indian art, including sculptures, paintings, and decorative arts.\n* Afternoon: Head to the Government Museum (2:00 PM - 4:30 PM), one of the oldest and largest museums in India. Explore the exhibits on archaeology, anthropology, and natural history.\n* Evening: Experience the vibrant cultural scene at the Kalakshetra Foundation (6:30 PM - 8:30 PM), a renowned institution for traditional Indian dance, music, and art.\n\n**Day 4: Day Trip to Mahabalipuram**\n\n* Morning: Take a day trip to Mahabalipuram (9:00 AM - 5:00 PM), a UNESCO World Heritage Site and ancient port city. Visit the famous Shore Temple, Arjuna's Penance, and the Pancha Rathas, among other attractions.\n* Evening: Return to Chennai and enjoy a farewell dinner at one of the city's popular restaurants, such as the famous Dasaprakash or the modern fusion eatery, The Flying Pan.\n\n**Budget Breakdown:**\n\n* Accommodation (avg.): ₹2,500 - ₹3,500 per night ( approx. $35 - $50)\n* Food: ₹500 - ₹1,000 per meal (approx. $7 - $14)\n* Attractions: ₹50 - ₹200 per person (approx. $0.70 - $2.80)\n* Transportation: ₹100 - ₹200 per day (approx. $1.40 - $2.80)\n* Total: ₹10,000 - ₹15,000 per person for 4 days (approx. $140 - $210)\n\n**Essential Packing List:**\n\n* Lightweight and breathable clothing (cotton, linen, or silk)\n* Comfortable walking shoes or sandals\n* Sunglasses and sun hat for outdoor activities\n* Power adapter for charging electronic devices (Type D, 230V, 50Hz)\n* Water bottle and refillable containers for water and snacks\n* Insect repellent and sunscreen with high SPF\n* Power bank for extra battery backup\n* Camera and charger for capturing memories\n* Reusable bag or backpack for carrying essentials\n\n**Tips and Essentials:**\n\n* Chennai is a hot and humid city, so it's essential to stay hydrated and take breaks in shaded areas.\n* Wear comfortable clothing and shoes to explore the city.\n* Try to avoid visiting attractions during peak hours (12:00 PM - 3:00 PM) to avoid crowds.\n* Be prepared for occasional power outages and internet connectivity issues.\n* Respect local customs and traditions, especially when visiting temples or cultural institutions.\n* Don't forget to try the local cuisine, including dosas, idlis, and vadas!\n\nEnjoy your trip to Chennai!",
    "budget": 760,
    "packing_list": [
        "Essentials: passport, tickets, wallet",
        "Electronics: phone, charger, power bank",
        "Rain gear: umbrella, waterproof shoes"
    ]
}