{
    "destination": "Paris",
    "weather": "26.9°C, overcast clouds\n25.53°C, light rain\n20.26°C, moderate rain",
    "hotels": "Top Hotels & Attractions in Paris:\n- [TripAdvisor Hotels](https://www.tripadvisor.com/Search?q=Paris+hotels)\n- [Travel Guides](https://www.hotels.com/go/Paris)\n",
    "itinerary": "Bonjour! I'd be delighted to help you plan your 3-day Parisian adventure.\n\n**Day 1: June 10th (26.9°C, overcast clouds)**\n\n* Morning (9:00 am - 12:00 pm):\n\t+ Start at the iconic Eiffel Tower (approx. 10-15 minutes from most Parisian hotels). Take the stairs or elevator to the top for breathtaking views of the city. **Must-visit spot!**\n\t+ Afterward, stroll to the nearby Champ de Mars park for a picnic or grab a coffee at one of the many cafes.\n* Afternoon (1:00 pm - 5:00 pm):\n\t+ Visit the world-renowned Louvre Museum (approx. 15-20 minutes from the Eiffel Tower). Book tickets in advance to avoid long lines. Be sure to see the Mona Lisa and other famous artworks.\n\t+ Take a short walk to the nearby Tuileries Garden for a relaxing break.\n* Evening (7:00 pm - 10:00 pm):\n\t+ Enjoy a Seine River Cruise (approx. 30-40 minutes from the Louvre) and admire the City of Light's stunning landmarks while learning about its rich history.\n\t+ End the evening with a delicious dinner at a traditional Parisian bistro, such as Le Comptoir du Relais or Chez L'Ami Jean.\n\n**Day 2: June 11th (25.53°C, light rain)**\n\n* Morning (9:00 am - 12:00 pm):\n\t+ Visit the iconic Notre-Dame Cathedral (approx. 10-15 minutes from the Seine River Cruise embarkation point). Take a moment to appreciate the Gothic architecture and history.\n\t+ Explore the charming Île de la Cité, including the beautiful Sainte-Chapelle with its stunning stained-glass windows.\n* Afternoon (1:00 pm - 5:00 pm):\n\t+ Head to the Musée d'Orsay (approx. 20-25 minutes from Île de la Cité) to admire an impressive collection of Impressionist and Post-Impressionist art. Highlights include works by Monet, Renoir, and Van Gogh.\n\t+ Take a short walk to the nearby Pont des Arts bridge for a romantic view of the Seine.\n* Evening (7:00 pm - 10:00 pm):\n\t+ Enjoy a traditional French cabaret show at the world-famous Moulin Rouge (approx. 20-25 minutes from the Musée d'Orsay).\n\t+ Savor a decadent dinner at a Michelin-starred restaurant, such as Septime or Le Grand Vefour.\n\n**Day 3: June 12th (20.26°C, moderate rain)**\n\n* Morning (9:00 am - 12:00 pm):\n\t+ Visit the world's most famous cemetery, Père Lachaise (approx. 20-25 minutes from the Moulin Rouge). Pay your respects to famous residents like Oscar Wilde, Jim Morrison, and Frédéric Chopin.\n\t+ Explore the charming Montmartre neighborhood, known for its bohemian vibe, street artists, and stunning views from Sacré-Cœur Basilica.\n* Afternoon (1:00 pm - 5:00 pm):\n\t+ Head to the trendy Marais neighborhood (approx. 15-20 minutes from Montmartre) for a fashion-forward afternoon. Explore the historic streets, art galleries, and boutiques.\n\t+ Visit the stunning Palais-Royal gardens for a peaceful escape from the city.\n* Evening (7:00 pm - 10:00 pm):\n\t+ Enjoy a farewell dinner at a cozy, family-run eatery, such as Le Pied de Cochon or Chez Eugène.\n\t+ End the evening with a scenic walk along the Seine or a visit to the iconic Notre-Dame Cathedral for a peaceful reflection.\n\n**Budget Breakdown:**\n\n* Accommodation: €150-€250 per night (avg.) for a 3-star hotel or Airbnb\n* Food: €30-€50 per meal for mid-range restaurants and cafes\n* Attractions: €15-€30 per person for museum and landmark tickets\n* Transportation: €2-€5 per ride for public transportation or €10-€15 per day for a Paris Visite pass\n* Total estimated budget: €500-€800 per person for the 3-day trip\n\n**Essential Packing List:**\n\n* Comfortable walking shoes\n* Lightweight rain jacket or umbrella\n* Sunglasses and sun hat for overcast days\n* Scarf or shawl for cooler evenings\n* Power adapter for France (Type E/F)\n* Camera and charger\n* Reusable water bottle\n* Travel documents (passport, travel insurance, etc.)\n* Medications and essentials (if applicable)\n* A small backpack or cross-body bag for carrying essentials during the day\n\nFeel free to adjust this itinerary based on your personal preferences and interests. Bon voyage et bon séjour à Paris!",
    "budget": 750,
    "packing_list": [
        "Essentials: passport, tickets, wallet",
        "Electronics: phone, charger, power bank",
        "Rain gear: umbrella, waterproof shoes"
    ]
}